In [1]:
import pandas as pd

In [26]:
data=pd.read_csv('demand.csv')

In [27]:
data.shape

(150150, 9)

In [28]:
data.head(5)

,record_ID,week,store_id,sku_id,total_price,base_price,is_featured_sku,is_display_sku,units_sold
0,1,17/01/11,8091,216418,99.0375,111.8625,0,0,20
1,2,17/01/11,8091,216419,99.0375,99.0375,0,0,28
2,3,17/01/11,8091,216425,133.9500,133.9500,0,0,19
3,4,17/01/11,8091,216233,133.9500,133.9500,0,0,44
4,5,17/01/11,8091,217390,141.0750,141.0750,0,0,52

In [29]:
data.tail(5)

,record_ID,week,store_id,sku_id,total_price,base_price,is_featured_sku,is_display_sku,units_sold
150145,212638,09/07/13,9984,223245,235.8375,235.8375,0,0,38
150146,212639,09/07/13,9984,223153,235.8375,235.8375,0,0,30
150147,212642,09/07/13,9984,245338,357.6750,483.7875,1,1,31
150148,212643,09/07/13,9984,547934,141.7875,191.6625,0,1,12
150149,212644,09/07/13,9984,679023,234.4125,234.4125,0,0,15

In [30]:
data.dtypes

record_ID            int64
week                object
store_id             int64
sku_id               int64
total_price        float64
base_price         float64
is_featured_sku      int64
is_display_sku       int64
units_sold           int64
dtype: object

In [31]:
data['week'].unique()

array(['17/01/11', '24/01/11', '31/01/11', '07/02/11', '14/02/11',
       '21/02/11', '28/02/11', '07/03/11', '14/03/11', '21/03/11',
       '28/03/11', '04/04/11', '11/04/11', '18/04/11', '25/04/11',
       '02/05/11', '09/05/11', '16/05/11', '23/05/11', '30/05/11',
       '06/06/11', '13/06/11', '20/06/11', '27/06/11', '04/07/11',
       '11/07/11', '18/07/11', '25/07/11', '01/08/11', '08/08/11',
       '15/08/11', '22/08/11', '29/08/11', '05/09/11', '12/09/11',
       '19/09/11', '26/09/11', '03/10/11', '10/10/11', '17/10/11',
       '24/10/11', '31/10/11', '07/11/11', '14/11/11', '21/11/11',
       '28/11/11', '05/12/11', '12/12/11', '19/12/11', '26/12/11',
       '02/01/12', '09/01/12', '16/01/12', '23/01/12', '30/01/12',
       '06/02/12', '13/02/12', '20/02/12', '27/02/12', '06/03/12',
       '13/03/12', '20/03/12', '27/03/12', '03/04/12', '10/04/12',
       '17/04/12', '24/04/12', '01/05/12', '08/05/12', '15/05/12',
       '22/05/12', '29/05/12', '05/06/12', '12/06/12', '19/06/12',
       '26/06/12', '03/07/12', '10/07/12', '17/07/12', '24/07/12',
       '31/07/12', '07/08/12', '14/08/12', '21/08/12', '28/08/12',
       '04/09/12', '11/09/12', '18/09/12', '25/09/12', '02/10/12',
       '09/10/12', '16/10/12', '23/10/12', '30/10/12', '06/11/12',
       '13/11/12', '20/11/12', '27/11/12', '04/12/12', '11/12/12',
       '18/12/12', '25/12/12', '01/01/13', '08/01/13', '15/01/13',
       '22/01/13', '29/01/13', '05/02/13', '12/02/13', '19/02/13',
       '26/02/13', '05/03/13', '12/03/13', '19/03/13', '26/03/13',
       '02/04/13', '09/04/13', '16/04/13', '23/04/13', '30/04/13',
       '07/05/13', '14/05/13', '21/05/13', '28/05/13', '04/06/13',
       '11/06/13', '18/06/13', '25/06/13', '02/07/13', '09/07/13'],
      dtype=object)

In [32]:
data['week'].nunique()

130

In [33]:
data['week'].value_counts()

17/01/11    1155
27/11/12    1155
13/11/12    1155
06/11/12    1155
30/10/12    1155
            ...
10/10/11    1155
03/10/11    1155
26/09/11    1155
19/09/11    1155
09/07/13    1155
Name: week, Length: 130, dtype: int64

# missing values

In [34]:
data.isnull()

,record_ID,week,store_id,sku_id,total_price,base_price,is_featured_sku,is_display_sku,units_sold
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
150145,False,False,False,False,False,False,False,False,False
150146,False,False,False,False,False,False,False,False,False
150147,False,False,False,False,False,False,False,False,False
150148,False,False,False,False,False,False,False,False,False
150149,False,False,False,False,False,False,False,False,False

In [35]:
data.isnull().sum()

record_ID          0
week               0
store_id           0
sku_id             0
total_price        1
base_price         0
is_featured_sku    0
is_display_sku     0
units_sold         0
dtype: int64

In [36]:
data['total_price']

0          99.0375
1          99.0375
2         133.9500
3         133.9500
4         141.0750
            ...
150145    235.8375
150146    235.8375
150147    357.6750
150148    141.7875
150149    234.4125
Name: total_price, Length: 150150, dtype: float64

In [37]:
for i in data.columns:
    if data[i].isnull().sum()>=1:
        print(i)

total_price